БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/РедактированиеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеКонтактнойИнформации</name>
  <comment>Служит для редактирования контактной информации</comment>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <comment>Тип</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <comment>Вид</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <comment>Представление</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле1</name>
    <comment>Поле 1 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле2</name>
    <comment>Поле 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле3</name>
    <comment>Поле 3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле4</name>
    <comment>Поле 4</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле5</name>
    <comment>Поле 5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле6</name>
    <comment>Поле 6</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле7</name>
    <comment>Поле 7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле8</name>
    <comment>Поле 8</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле9</name>
    <comment>Поле 9</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьВРегистр</name>
    <comment>Записывать в регистр</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле10</name>
    <comment>Поле 10</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле11</name>
    <comment>Поле 11</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле12</name>
    <comment>Поле 12</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьОбъекта</name>
    <comment>Доступность объекта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/Forms/ФормаВыбораКонтактнойИнформацииЧек/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтактнаяИнформация.Параметры.УстановитьЗначениеПараметра("Объект"		 ,Параметры.Клиент);
	КонтактнаяИнформация.Параметры.УстановитьЗначениеПараметра("ИмяМетаданных","Клиенты");
	
	Элементы.КонтактнаяИнформацияЗаконногоПредставителя.Видимость = Ложь;
	Элементы.ЗаконныйПредставитель.Видимость = Ложь;
	Если ТипЗнч(Параметры.Клиент) = Тип("СправочникСсылка.Клиенты")
		И ЗначениеЗаполнено(Параметры.Клиент.ЗаконныйПредставитель)
	Тогда
		Если ТипЗнч(Параметры.Клиент.ЗаконныйПредставитель) = Тип("СправочникСсылка.Клиенты") Тогда
			
			ЗаконныйПредставитель = Параметры.Клиент.ЗаконныйПредставитель;
			Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
				КонтактнаяИнформацияЗаконногоПредставителя.Параметры.УстановитьЗначениеПараметра("ИмяМетаданных","Клиенты");
				КонтактнаяИнформацияЗаконногоПредставителя.Параметры.УстановитьЗначениеПараметра("Объект", ЗаконныйПредставитель);
				Элементы.КонтактнаяИнформацияЗаконногоПредставителя.Видимость = Истина;
			КонецЕсли;
		Иначе
			Если Параметры.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон
				И Не ПустаяСтрока(Параметры.Клиент.ЗаконныйПредставительТелефон)
			Тогда
				Элементы.ЗаконныйПредставитель.Видимость = Истина;
				Элементы.НомерТелефонаЗаконногоПредставителя.Заголовок = Параметры.Клиент.ЗаконныйПредставительТелефон;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСФормамиКлиент.УстановитьОтборСписка("Тип",   Параметры.ТипКИ, КонтактнаяИнформация);	
	РаботаСФормамиКлиент.УстановитьОтборСписка("Тип",   Параметры.ТипКИ, КонтактнаяИнформацияЗаконногоПредставителя);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КонтактнаяИнформацияИзменение" Тогда
		Элементы.КонтактнаяИнформация.Обновить();
		Если Элементы.КонтактнаяИнформацияЗаконногоПредставителя.Видимость Тогда
			Элементы.КонтактнаяИнформацияЗаконногоПредставителя.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КонтактнаяИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.КонтактнаяИнформация.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Закрыть(ТД.Представление);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияСписокПередНачаломИзменения(Элемент, Отказ)
	
	КонтактнаяИнформацияКлиент.КонтактнаяИнформацияСписокПередНачаломИзменения(Элементы.КонтактнаяИнформация, ЭтаФорма, Параметры.Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	КонтактнаяИнформацияКлиент.СозданиеНовойКИ(Параметры.Клиент);
	Элементы.КонтактнаяИнформация.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияЗаконногоПредставителяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.КонтактнаяИнформацияЗаконногоПредставителя.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Закрыть(ТД.Представление);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияЗаконныйСписокПередНачаломИзменения(Элемент, Отказ)
	
	КонтактнаяИнформацияКлиент.КонтактнаяИнформацияСписокПередНачаломИзменения(Элементы.КонтактнаяИнформацияЗаконногоПредставителя, ЭтаФорма, ЗаконныйПредставитель);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияЗаконныйСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	КонтактнаяИнформацияКлиент.СозданиеНовойКИ(ЗаконныйПредставитель);
	Элементы.КонтактнаяИнформацияЗаконногоПредставителя.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВСписке(Команда)
	
	ТекущиеДанные = Элементы.КонтактнаяИнформация.ТекущиеДанные;
	Если ТекущиеДанные<> Неопределено Тогда
		Закрыть(ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КИСоздать(Команда)
	КонтактнаяИнформацияСписокПередНачаломДобавления(Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КИИзменить(Команда)
	КонтактнаяИнформацияСписокПередНачаломИзменения(Неопределено,Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВСпискеЗаконный(Команда)
	
	ТекущиеДанные = Элементы.КонтактнаяИнформацияЗаконногоПредставителя.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Закрыть(ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КИСоздатьЗаконный(Команда)
	КонтактнаяИнформацияЗаконныйСписокПередНачаломДобавления(Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КИИзменитьЗаконный(Команда)
	КонтактнаяИнформацияЗаконныйСписокПередНачаломИзменения(Неопределено,Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(Элементы.НомерТелефонаЗаконногоПредставителя.Заголовок);
КонецПроцедуры

#КонецОбласти
